package com;

public class Animal {
    public void eat () {
    }
    //com.Animal деген класс тузунуз жана бир метод кошунуз. Анын 3 наследнигин тузунуз.
    //com.Shark деген класска attack(), com.Turtle деген класска swim() жана com.Eagle деген класска fly() методторун тузосуз.
    //com.Animal тибин колдонуп массив тузунуз жана ал жакка анын наследниктерин кошунуз.
    //instanceOf жана getClass()-ты колдонуп com.Animal массивиндеги жаныбарлардын оздорунун методдорун чыгарыныз.
    //Ар бир объект учун оз озунчо массив тузуп com.Animal массивиндеги жаныбарларды болуп оз озунун массивине салыныз

}
